//기본 반복문
// for (초기화식; 조건식; 증감식)

// for (let index = 0; index < 10; index++) {
//   console.log(`인사를 ${index + 1} 번째 드립니다! 🙇🏻`)
// }

// for (let index = 0; index < 10; index += 1) {
//   console.log(`인사를 ${index + 1} 번째 드립니다! 🙇🏻`)
// }

// 보통 코테 풀면 반복을 하는거라,
// for문을 쓰게 된다.

// 2중 반복문
// for (let i = 0; i < 3; i += 1) {
//   console.log(`상위 for문 입니다. ${i + 1}번째 작동 중`);
//   for (let j = 0; j < 5; j += 1) {
//     console.log(`하위 for문 입니다. i는 ${i}, j는 ${j} 입니다!`)
//   }
// }

// 실제로 2중 반복문 써서 풀면 시간 초과 늪에 빠짐.
// 2중 반복문은 이정도가 있다 정도만 알고, 지양하는게 나음.
// n제곱 같은 것은 피해라.n제곱 같은건 나중에 코테같은거 할 때 더 깊게 배운다.
